{
    "advancedPawn": "One of your pawns is deep into the opponent position, maybe threatening to promote.",
    "advantage": "Seize your chance to get a decisive advantage. (200cp ≤ eval ≤ 600cp)",
    "anastasiaMate": "A knight and rook or queen team up to trap the opposing king between the side of the board and a friendly piece.",
    "arabianMate": "A knight and a rook team up to trap the opposing king on a corner of the board.",
    "attackingF2F7": "An attack focusing on the f2 or f7 pawn, such as in the fried liver opening.",
    "attraction": "An exchange or sacrifice encouraging or forcing an opponent piece to a square that allows a follow-up tactic.",
    "backRankMate": "Checkmate the king on the home rank, when it is trapped there by its own pieces.",
    "bishopEndgame": "An endgame with only bishops and pawns.",
    "bodenMate": "Two attacking bishops on criss-crossing diagonals deliver mate to a king obstructed by friendly pieces.",
    "capturingDefender": "Removing a piece that is critical to defense of another piece, allowing the now undefended piece to be captured on a following move.",
    "castling": "Bring the king to safety, and deploy the rook for attack.",
    "clearance": "A move, often with tempo, that clears a square, file or diagonal for a follow-up tactical idea.",
    "crushing": "Spot the opponent blunder to obtain a crushing advantage. (eval ≥ 600cp)",
    "defensiveMove": "A precise move or sequence of moves that is needed to avoid losing material or another advantage.",
    "deflection": "A move that distracts an opponent piece from another duty that it performs, such as guarding a key square. Sometimes also called 'overloading'.",
    "discoveredAttack": "Moving a piece that previously blocked an attack by another long range piece, such as a knight out of the way of a rook.",
    "doubleBishopMate": "Two attacking bishops on adjacent diagonals deliver mate to a king obstructed by friendly pieces.",
    "doubleCheck": "Checking with two pieces at once, as a result of a discovered attack where both the moving piece and the unveiled piece attack the opponent’s king.",
    "dovetailMate": "A queen delivers mate to an adjacent king, whose only two escape squares are obstructed by friendly pieces.",
    "enPassant": "A tactic involving the en passant rule, where a pawn can capture an opponent pawn that has bypassed it using its initial two-square move.",
    "endgame": "A tactic during the last phase of the game.",
    "equality": "Come back from a losing position, and secure a draw or a balanced position. (eval ≤ 200cp)",
    "exposedKing": "A tactic involving a king with few defenders around it, often leading to checkmate.",
    "fork": "A move where the moved piece attacks two opponent pieces at once.",
    "hangingPiece": "A tactic involving an opponent piece being undefended or insufficiently defended and free to capture.",
    "hookMate": "Checkmate with a rook, knight, and pawn along with one enemy pawn to limit the enemy king’s escape.",
    "interference": "Moving a piece between two opponent pieces to leave one or both opponent pieces undefended, such as a knight on a defended square between two rooks.",
    "intermezzo": "Instead of playing the expected move, first interpose another move posing an immediate threat that the opponent must answer. Also known as 'Zwischenzug' or 'In between'.",
    "kingsideAttack": "An attack of the opponent's king, after they castled on the king side.",
    "knightEndgame": "An endgame with only knights and pawns.",
    "long": "Three moves to win.",
    "master": "Puzzles from games played by titled players.",
    "masterVsMaster": "Puzzles from games between two titled players.",
    "mate": "Win the game with style.",
    "mateIn1": "Deliver checkmate in one move.",
    "mateIn2": "Deliver checkmate in two moves.",
    "mateIn3": "Deliver checkmate in three moves.",
    "mateIn4": "Deliver checkmate in four moves.",
    "mateIn5": "Figure out a long mating sequence.",
    "middlegame": "A tactic during the second phase of the game.",
    "oneMove": "A puzzle that is only one move long.",
    "opening": "A tactic during the first phase of the game",
    "pawnEndgame": "An endgame with only pawns.",
    "pin": "A tactic involving pins, where a piece is unable to move without revealing an attack on a higher value piece.",
    "promotion": "Promote one of your pawns to a queen or minor piece.",
    "queenEndgame": "An endgame with only queens and pawns.",
    "queenRookEndgame": "An endgame with only queens, rooks, and pawns.",
    "queensideAttack": "An attack of the opponent's king, after they castled on the queen side.",
    "quietMove": "A move that does not make a check or capture, but does prepare an unavoidable threat for a later move.",
    "rookEndgame": "An endgame with only rooks and pawns.",
    "sacrifice": "A tactic involving giving up material in the short-term, to gain an advantage again after a forced sequence of moves.",
    "short": "Two moves to win.",
    "skewer": "A motif involving a high value piece being attacked, moving out the way, and allowing a lower value piece behind it to be captured or attacked, the inverse of a pin.",
    "smotheredMate": "A checkmate delivered by a knight in which the mated king is unable to move because it is surrounded (or smothered) by its own pieces.",
    "superGM": "Puzzles from games played by the best players in the world.",
    "trappedPiece": "A piece is unable to escape capture as it has limited moves.",
    "underPromotion": "Promotion to a knight, bishop, or rook.",
    "veryLong": "Four moves or more to win.",
    "xRayAttack": "A piece attacks or defends a square, through an enemy piece.",
    "zugzwang": "The opponent is limited in the moves they can make, and all moves worsen their position."
  }
  